# Some Useful Methods in Pandas

Hi Guys, Welcome to [Tirendaz Academy](https://youtube.com/c/tirendazacademy) üòÄ
</br>
In this notebook, I'm going to show some useful methods.
</br>
Happy Learning üê±‚Äçüèç

In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,2,3,4],
            index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
s["a"]

1

In [4]:
s2=s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [5]:
s3=pd.Series(["blue","yellow","purple"],
             index=[0,2,4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [6]:
s3.reindex(range(6),method="ffill")

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [5]:
np.arange(9).reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [3]:
pd.DataFrame(np.arange(9).reshape(3,3))

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [7]:
df=pd.DataFrame(np.arange(9).reshape(3,3),
                index=["a","c","d"],
                columns=["Tim","Tom","Kate"])
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [8]:
df2=df.reindex(["d","c","b","a"])
df2

   Tim  Tom  Kate
d  6.0  7.0   8.0
c  3.0  4.0   5.0
b  NaN  NaN   NaN
a  0.0  1.0   2.0

In [9]:
names=["Kate","Tim","Tom"]
df.reindex(columns=names)

   Kate  Tim  Tom
a     2    0    1
c     5    3    4
d     8    6    7

In [8]:
df.loc[["c","d"]]

   Tim  Tom  Kate
c    3    4     5
d    6    7     8

In [15]:
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [19]:
df.iloc[1,1]

4

In [30]:
df.loc["d"]

Tim     6
Tom     7
Kate    8
Name: d, dtype: int32

In [33]:
df.drop("a",inplace=True)

In [34]:
df

   Tim  Tom  Kate
c    3    4     5
d    6    7     8

In [35]:
df=df.drop("a")

KeyError: "['a'] not found in axis"

In [11]:

s=pd.Series(np.arange(5.),
            index=["a","b","c","d","e"])
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
new_s=s.drop("b")
new_s

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
s.drop(["c","d"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [36]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                  index=["Kate","Tim",
                         "Tom","Alex"],
                  columns=list("ABCD"))
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [15]:
data.drop(["Kate","Tim"])

       A   B   C   D
Tom    8   9  10  11
Alex  12  13  14  15

In [16]:
data.drop("A",axis=1)

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15

In [17]:
data.drop("Kate",axis=0)

       A   B   C   D
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [18]:
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [37]:
data.mean(axis="index")

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [38]:
data.mean(axis="columns")

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64

In [39]:
data.mean(axis=0)

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [40]:
data.mean(axis=1)

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64

In [41]:
data.mean()

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [42]:
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [43]:
data["E"]=data["A"]*1.5

In [44]:
data

       A   B   C   D     E
Kate   0   1   2   3   0.0
Tim    4   5   6   7   6.0
Tom    8   9  10  11  12.0
Alex  12  13  14  15  18.0

In [46]:
def cuadrado(x):
    return x**2

In [47]:
cuadrado(2)

4

In [48]:
data["F"]=cuadrado(data["A"])

In [49]:
data

       A   B   C   D     E    F
Kate   0   1   2   3   0.0    0
Tim    4   5   6   7   6.0   16
Tom    8   9  10  11  12.0   64
Alex  12  13  14  15  18.0  144

In [56]:
def tran(x):
    return chr(x).upper()

In [58]:
tran(90)

'Z'

In [68]:
data["F"]=data["A"]*10

In [69]:
data

       A   B   C   D     E    F
Kate   0   1   2   3   0.0    0
Tim    4   5   6   7   6.0   40
Tom    8   9  10  11  12.0   80
Alex  12  13  14  15  18.0  120

In [70]:
data["G"]=data["F"].apply(tran)

In [71]:
data

       A   B   C   D     E    F  G
Kate   0   1   2   3   0.0    0   
Tim    4   5   6   7   6.0   40  (
Tom    8   9  10  11  12.0   80  P
Alex  12  13  14  15  18.0  120  X

In [74]:
chr(80)

'P'

In [75]:
data["H"]=data["F"].apply(lambda x: chr(x)*2)

In [76]:
data

       A   B   C   D     E    F  G   H
Kate   0   1   2   3   0.0    0       
Tim    4   5   6   7   6.0   40  (  ((
Tom    8   9  10  11  12.0   80  P  PP
Alex  12  13  14  15  18.0  120  X  xx

In [77]:
'a'*2

'aa'

Don't forget to follow us on [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [GitHub](http://github.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) | [Kaggle](https://www.kaggle.com/tirendazacademy) üòé